In [31]:
import pandas as pd
import numpy as np

In [32]:
labels = ['a','b','c']
my_data = [10,20,30]
# transforming that data into numpy array
arr = np.array(my_data)
#we can also create a dictionary

d = {'a':10,'b':20,'c':30}

In [33]:
arr

array([10, 20, 30])

In [34]:
d

{'a': 10, 'b': 20, 'c': 30}

In [35]:
#Creating a Pandas series
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [36]:
pd.Series(data=my_data,index=labels)  # series with index as labels

a    10
b    20
c    30
dtype: int64

In [37]:
# create a series from a numpy array
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [38]:
# a series from a dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [39]:
# we can add different types of object to a series
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [40]:
# here we can add built in finctions
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [41]:
#making 2 new series
series1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
series2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [42]:
series1['USA']

np.int64(1)

In [43]:
series1 + series2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [44]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [45]:
np.random.seed(101)

In [46]:
#start by creating  a dataframe
df = pd.DataFrame(data=randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
#grabbing the y column
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [48]:
type(df['Y'])

pandas.core.series.Series

In [49]:
#grabbing multiple columns
df[['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [50]:
df['new'] = df['Y'] + df['Z']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [51]:
df.drop('new',axis=1,)
#deleting a column
#axis = 1 because we are deleting a column not a row
#the axis is set to 0 by default which denotes rows

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
#strange, there is no change in the dataframe permetently
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [53]:
# delete a column permanently
del df['new']
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
#or we can also delete by adding inplace=True
df.drop('Z',axis=1,inplace=True)

In [55]:
#we can also drop rows
df.drop('A',axis=0)
#axis is 0 by default which denotes rows

          W         X         Y
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [56]:
df

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [57]:
#so we have to add inplace=True
df.drop('A',axis=0,inplace=True)

In [58]:
df

          W         X         Y
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [59]:
df.shape

(4, 3)

In [60]:
df = pd.DataFrame(data=randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [61]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [62]:
# grab a row
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [63]:
# location by indexing
df.iloc[1]

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

In [66]:
#grabing a single element
df.iloc[1,1]
#or 
df.loc['A','Y']
print(df)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [65]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [67]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [68]:
#grabing the values which are greater than 0
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [69]:
resultdf = df[df['W']>0]
resultdf

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [71]:
#we can have the same result by doing this
df[df['W']>0]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [70]:
#we can grab multiple columns from the resultdf by passing a list
resultdf[['Y','X']]
#or
df[df['W']>0][['Y','X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [72]:
boolser = df['W']>0
# we can make a list of columns we want to grab
result = ['Y','X']
#now we can pass the boolser and the result list to the dataframe
df[boolser][result]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [73]:
df[(df['W']>0) & (df['Y']<1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [74]:
# resetting the index
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [75]:
#creatinga new index
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [77]:
#adding a new column
df['States'] = newind
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [78]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [79]:
outside = ['G1','G1','G1','G2','G2','G2']
#outside variable is a list of 6 elements
inside = [1,2,3,1,2,3]
#inside variable is a list of 6 elements but the elements are repeated

In [80]:
#zip will combine the two lists, outside and inside according to their index
hier_index = list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]